#include "model/Instrument.h"

/*
大连和郑州会根据先开先平来平掉今昨仓，比如昨天有10手，今天有5手，平12手，会平掉昨天的10手加今天的2手。
中金的平今和上海不一样，你只要当天开过任何仓，你所有的平仓都算你平今

Instrument品种，可以包含多个Instrument(合约），最多12个，最少3个（债券，3 6 9 12），交易所有查询接口
Leg是具体一个Instrument的方向，开平和属性（套利-机构才能使用，套保-机构才能使用，投机-散户，做市-做市商，在一开始就确定了。

OrderInfo - 根据具体场景会发不同的情况的单
	Limit - 限价单，会部分成交，不会自动撤单
	FAK - 立即成交其余撤单
	FOK - 立即全部成否则自动全部撤单
Dealing是Leg+OrderInfo+User的委托，会根据回报和应答来变更信息
Trade是成交回报
成交回报同时更新Dealing和Trade，委托回报和委托应答更新Dealing
Limit的委托回报(国内市场）没有成交价格，只更新成交数量的变化（已成交总量）
Limit的成交回报是每次成交的明细且包含价格
因为FAK和FOK不成交就系统撤单（系统撤单通过委托回报中的已撤单状态表示），没有撤单回报，成交价格可能更优，在FAK部分成交需要根据委托回报中的成交总量生成一个Trade，价格是OrderPrice
限流同FAK的系统撤单一样，不过没有系统委托号（systemID)

HedgeLegs中需要计算不同市场出现的汇率或Multiple

Band
SpreadsContract
HedgePosition
HFMarketingPosition
LegGroup


Bond国债只有三个季月，只能取3 6 9 12，取最近的三个秀月，季月的第三个周五交割，第四周的周一就变了
Index股指，例如，每个月第三个周五切换
  1 2 3，2 3 6，3 4 6， 4 5 6 ， 5 6 9，6 7 9，7 8 9，8 9 12，9 10 12，10 11 12，11 12 3， 12 1 3

程序部署在哪，自动策略就会锁定对应的市场，例如如果部署在上海，就会只连中金和上期，如果是部署在大连，只会连大连交易所，如果部署在香港，只会连HK和CME

CTP，飞马等柜台目前均提供连所有国内交易所的能力，因帐号相同，故每次只能连接一个接口，HK可能会连接多个接口


*/

